#define G(C)for(C,i=n[T];j=X+i%4,k=Y+i/4%4,k=k*W+j,i;i>>=4)
int W=10,H=25,S,i,j,k,c,d=1,X=0,Y=0,T=0,*m,n[]={51264,12816,21520,21520,25872,
34113,21537,38208,25921,38481,38484,38209,25922,43345,34388,38160,25920,38177,
42580,38993};M(int*v,int l){G(*v+=l)j+1&&j-W&&k<S&&!m[k]||(c=0);return c||(*v
-=l,v-&Y||(c=-1));}main(){for(srand(m=calloc(S=W*H,4));c-27;_sleep(50),system(
"cls")){G(c=kbhit()?getch()&95:1)m[k]=0;c^65&&c^68||M(&X,c&1?-1:1),c^83||M(&Y,
1);c^87||(i=T<8?1:3,M(&T,T&i^i?1:-i));G(++d-9||M(&Y,d=c=1))m[k]=1;for(;i<S;++i
%W||puts("|"))printf(m[i]?"[]":"  ");if(c==-1)for(j=Y||(c=27),T=rand()%20,Y=X=
0,i=S;i;i--%W||(j=W),j-=m[i])if(!j)for(k=i+=W;--k-W;m[k]=m[k-W]);}}

/*
9行俄罗斯方块, 671字符(不包含换行符), 在1行80字符限制下仅可能减少代码;
AD移动, S下坠, W旋转, 某一行填满方块则消行, 当方块堆到顶层或按下Esc键时游戏结束;
可自定义地图尺寸(W, H)
比行数没意思, 较真还得看字符量(雾)
此处使用gcc编译通过, vs需要屏蔽4996号错误, 加上下面一行代码
#pragma warning(disable:4996)

2020.11.13
    简单的压缩, 行数-1, 字符: 709 => 671
2020.10.2
    完善说明
2020.9.20
    上传
*/
